liuzhe0812/mona-agent/hardware/esp32/esp32-firmware/sdkconfig.defaults
# ============================================================
# ESP32-S3 AI Character Device — Default SDK Configuration
# Chip: ESP32-S3-WROOM-1-N16R8 (16MB Flash, 8MB Octal PSRAM)
# ============================================================

# ---- Target chip ----
CONFIG_IDF_TARGET="esp32s3"

# ---- CPU frequency: 240 MHz ----
CONFIG_ESP_DEFAULT_CPU_FREQ_240=y

# ---- Flash: 16MB, QIO, 80MHz ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- Partition table: custom ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- PSRAM: Octal, 8MB, 80MHz ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Allow malloc to allocate from PSRAM
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# Allow WiFi/LWIP buffers in PSRAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- WiFi ----
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# ---- HTTP Client ----
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
# HTTP client buffer size
CONFIG_ESP_HTTP_CLIENT_BUFFER_SIZE=8192

# ---- FreeRTOS ----
# Tick rate: 1000 Hz (1ms tick)
CONFIG_FREERTOS_HZ=1000
# Disable task watchdog (avoid false triggers during network ops)
CONFIG_ESP_TASK_WDT=n

# ---- LWIP ----
# TCP MSS: 1460
CONFIG_LWIP_TCP_MSS=1460
CONFIG_LWIP_MAX_SOCKETS=16

# ---- Console / Logging ----
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# ---- I2S (new driver) ----
CONFIG_SOC_I2S_SUPPORTS_ADC=n

# ---- Compiler optimization ----
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
